# Calculating Lead-Based Returns with Rule-Based Classification using Persona's Dataset

# Task 1: 
Answer the following questions.

Question 1: Read the persona.csv file and show the general information about the dataset.

In [1]:
# Libraries
import pandas as pd

# Settings
pd.set_option('display.float_format', lambda x: '%.3f' % x)
pd.set_option('display.width', 500)

In [2]:
df = pd.read_csv('persona.csv')

In [3]:
def check_df(dataframe, head=7, tail=7):
    '''
    Prints the general information about the given dataframe e.g. shape, head,
    tail, info, descriptive statistics, etc.

    Parameters
    ----------
    dataframe : DataFrame
        The dataframe that we want to have general information about.
    head: int
        Prints the first n rows of the dataframe.
    tail: int
        Prints the last n rows of the dataframe.
    '''
    print('####### Shape #######')
    print(dataframe.shape)
    print('####### Info #######')
    print(dataframe.info())
    print('####### Head #######')
    print(dataframe.head(head))
    print('####### Tail #######')
    print(dataframe.tail(tail))
    print('####### Descriptive Statistics #######')
    print(dataframe.describe([0.05, 0.25, 0.50, 0.75 ,0.95, 0.99]).T)
    print('####### NA #######')
    print(dataframe.isnull().sum())
    print('####### Number of Unique Values #######')
    print(dataframe.nunique())


check_df(df)

####### Shape #######
(5000, 5)
####### Info #######
<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB
None
####### Head #######
   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17
5     29  android  male     bra   17
6     19  android  male     bra   17
####### Tail #######
      PRICE   SOURCE     SEX COUNTRY  AGE
4993     39      ios    male     usa   27
4994     39  android  female     bra   31
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31
####### Descriptive Statistics #######
         count   mean    std    min     5%    25%    50%    75%    95%    99%    max
PRICE 5000.000 34.132 12.465  9.000 19.000 29.000 39.000 39.000 49.000 59.000 59.000
AGE   5000.000 23.581  8.996 15.000 15.000 17.000 21.000 27.000 43.000 53.000 66.000
####### NA #######
PRICE      0
SOURCE     0
SEX        0
COUNTRY    0
AGE        0
dtype: int64
####### Number of Unique Values #######
PRICE       6
SOURCE      2
SEX         2
COUNTRY     6
AGE        46
dtype: int64

Question 2: How many unique 'SOURCE' are there? What are their frequencies?

In [4]:
# Unique values
df['SOURCE'].unique()

array(['android', 'ios'], dtype=object)

In [5]:
# Frequencies
df['SOURCE'].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

Question 3: How many unique 'PRICE's are there?

In [6]:
df['PRICE'].nunique()

6

Question 4: How many sales were made from which 'PRICE'?

In [7]:
df['PRICE'].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

Question 5: How many sales were made from which 'COUNTRY'?

In [8]:
df.groupby('COUNTRY').agg({'PRICE': 'count'})

         PRICE
COUNTRY
bra       1496
can        230
deu        455
fra        303
tur        451
usa       2065

Question 6: How much was earned in total from sales by 'COUNTRY'?

In [9]:
df.groupby('COUNTRY').agg({'PRICE': 'sum'})

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

Question 7: What are the sales numbers by 'SOURCE' types?

In [10]:
df.groupby('SOURCE').agg({'PRICE': 'count'})

         PRICE
SOURCE
android   2974
ios       2026

Question 8: What are the 'PRICE' averages by 'COUNTRY'?

In [11]:
df.groupby('COUNTRY').agg({'PRICE': 'mean'})

         PRICE
COUNTRY
bra     34.328
can     33.609
deu     34.033
fra     33.587
tur     34.787
usa     34.007

Question 9: What are the 'PRICE' averages according to 'SOURCE'?

In [12]:
df.groupby('SOURCE').agg({'PRICE': 'mean'})

         PRICE
SOURCE
android 34.175
ios     34.069

Question 10: What are the 'PRICE' averages in the 'COUNTRY-SOURCE' breakdown?

In [13]:
df.groupby(['COUNTRY', 'SOURCE']).agg({'PRICE': 'mean'})

                 PRICE
COUNTRY SOURCE
bra     android 34.387
        ios     34.222
can     android 33.331
        ios     33.951
deu     android 33.870
        ios     34.269
fra     android 34.312
        ios     32.776
tur     android 36.229
        ios     33.273
usa     android 33.760
        ios     34.372

# Task 2: 
What are the average earnings in breakdown of 'COUNTRY', 'SOURCE', 'SEX', 'AGE'?

In [14]:
df.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE']).agg({'PRICE': 'mean'}).head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15  38.714
                       16  35.944
                       17  35.667
                       18  32.256
                       19  35.207

# Task 3: 
Sort the output by 'PRICE'.
- To better see the output from the previous question, apply the sort_values() ​​method to 'PRICE' in descending order.
- Save the output as agg_df.

In [15]:
agg_df = df.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE']).agg({'PRICE': 'mean'}).sort_values('PRICE', ascending=False)
agg_df.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46  59.000
usa     android male   36  59.000
fra     android female 24  59.000
usa     ios     male   32  54.000
deu     android female 36  49.000

# Task 4: 
Convert the names in the index to variable names.
- All variables except 'PRICE' in the output of the third question are index names.
Convert these names to variable names.

In [16]:
agg_df = agg_df.reset_index()
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46 59.000
1     usa  android    male   36 59.000
2     fra  android  female   24 59.000
3     usa      ios    male   32 54.000
4     deu  android  female   36 49.000

# Task 5: 
Convert 'AGE' variable to categorical variable and add it to agg_df.
- Convert the numeric variable 'AGE' to a categorical variable.
- Construct the intervals convincingly.
  For Example: '0_18', '19_23', '24_30', '31_40', '41_70'

In [17]:
agg_df['AGE_CAT'] = pd.cut(agg_df['AGE'], bins=[0, 18, 23, 30, 40, agg_df['AGE'].max()], labels=['0_18', '19_23', '24_30', '31_40', '41_' + str(agg_df['AGE'].max())])
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0     bra  android    male   46 59.000   41_66
1     usa  android    male   36 59.000   31_40
2     fra  android  female   24 59.000   24_30
3     usa      ios    male   32 54.000   31_40
4     deu  android  female   36 49.000   31_40

# Task 6: 
Define new level-based customers (persona)
- Define new level-based customers (persona) and add them as variables to the dataset.
- Name of the new variable to be added: 'customers_level_based'
- You need to create the 'customers_level_based' variable by combining the observations from the output from the previous question.

Attention!
After creating 'customers_level_based' values ​​with list comprehension, these values ​​need to be deduplicated.
For Example: It could be more than one of the following: USA_ANDROID_MALE_0_18
It is necessary to take them to groupby() and get the 'PRICE' averages.

In [18]:
agg_df['customers_level_based'] = agg_df[['COUNTRY', 'SOURCE', 'SEX', 'AGE_CAT']].agg(lambda x: '_'.join(x).upper(), axis=1)
agg_df = agg_df[['customers_level_based', 'PRICE']]
agg_df.head()

      customers_level_based  PRICE
0    BRA_ANDROID_MALE_41_66 59.000
1    USA_ANDROID_MALE_31_40 59.000
2  FRA_ANDROID_FEMALE_24_30 59.000
3        USA_IOS_MALE_31_40 54.000
4  DEU_ANDROID_FEMALE_31_40 49.000

In [19]:
# Check duplicate values
agg_df['customers_level_based'].value_counts().head(10)

BRA_ANDROID_MALE_24_30      7
USA_ANDROID_MALE_41_66      7
USA_IOS_FEMALE_24_30        7
BRA_ANDROID_FEMALE_24_30    7
USA_ANDROID_MALE_24_30      7
BRA_IOS_MALE_31_40          6
USA_ANDROID_FEMALE_24_30    6
USA_IOS_MALE_24_30          6
BRA_IOS_FEMALE_24_30        6
USA_ANDROID_MALE_31_40      6
Name: customers_level_based, dtype: int64

In [20]:
# groupby() for deduplicate
agg_df = agg_df.groupby('customers_level_based', as_index=False).agg({'PRICE': 'mean'})

In [21]:
agg_df['customers_level_based'].value_counts().head(10)

BRA_ANDROID_FEMALE_0_18     1
TUR_ANDROID_FEMALE_0_18     1
TUR_IOS_FEMALE_19_23        1
TUR_IOS_FEMALE_0_18         1
TUR_ANDROID_MALE_41_66      1
TUR_ANDROID_MALE_31_40      1
TUR_ANDROID_MALE_24_30      1
TUR_ANDROID_MALE_19_23      1
TUR_ANDROID_MALE_0_18       1
TUR_ANDROID_FEMALE_41_66    1
Name: customers_level_based, dtype: int64

# Task 7: 
Segment new customers (persona).
- Segment new customers (Example: USA_ANDROID_MALE_0_18) into 4 segments by 'PRICE'.
- Add the segments to agg_df as a variable with the 'SEGMENT' naming.
- Describe segments (groupby() segments and get 'PRICE' mean, max, sum).

In [22]:
# Segments
agg_df['SEGMENT'] = pd.qcut(agg_df['PRICE'], 4, labels=['D', 'C', 'B', 'A'])
agg_df.head()

      customers_level_based  PRICE SEGMENT
0   BRA_ANDROID_FEMALE_0_18 35.645       B
1  BRA_ANDROID_FEMALE_19_23 34.077       C
2  BRA_ANDROID_FEMALE_24_30 33.864       C
3  BRA_ANDROID_FEMALE_31_40 34.898       B
4  BRA_ANDROID_FEMALE_41_66 36.737       A

In [23]:
agg_list = ['count', 'min', 'max', 'mean', 'median', 'std']
agg_df.groupby('SEGMENT').agg({'PRICE': agg_list})

        PRICE
        count    min    max   mean median   std
SEGMENT
D          28 19.000 32.333 29.207 30.956 3.638
C          27 32.500 34.077 33.510 33.628 0.493
B          27 34.104 36.000 35.000 34.900 0.637
A          27 36.061 45.429 38.691 37.686 2.582

# Task 8: 
Classify new customers and estimate how much revenue they can generate.
- What segment does a 33-year-old Turkish woman using ANDROID belong to and how much income is expected to earn on average?
- In which segment and on average how much income would a 35-year-old French woman using IOS expect to earn?

In [24]:
# ANDROID
new_user = 'TUR_ANDROID_FEMALE_31_40'
agg_df[agg_df['customers_level_based'] == new_user]

       customers_level_based  PRICE SEGMENT
72  TUR_ANDROID_FEMALE_31_40 41.833       A

In [25]:
# IOS
new_user = 'FRA_IOS_FEMALE_31_40'
agg_df[agg_df['customers_level_based'] == new_user]

   customers_level_based  PRICE SEGMENT
63  FRA_IOS_FEMALE_31_40 32.818       C